app/Http/Controllers/AddressControler.php

    public function addAddress(Request $request){

        $address = new Address;
        $address->address = $request->address;
        $address->user_id = auth()->user()->id;
        $address->lat = $request->lat;
        $address->lng = $request->lng;
        // $address->apartment = $request->apartment ?? $request->apartment;
        // $address->intercom = $request->intercom ?? $request->intercom;
        // $address->floor = $request->floor ?? $request->floor;
        // $address->entry = $request->entry ?? $request->entry;
        $address->save();
---
insert into `address` (`address`, `user_id`, `lat`, `lng`, `updated_at`, `created_at`) values ('230p', 1, 'NULL', 'NULL', '2022-01-31 17:06:44', '2022-01-31 17:06:44')