app/Http/Controllers/FrontEndController.php

    public function multyCityMode()
    {

        //Default headers
        $settings = Settings::findOrFail(1)->first();
        config(['global.header_title' => $settings->header_title]);
        config(['global.header_subtitle' => $settings->header_subtitle]);

        //Set the cookie of the last entered address
        $lastaddress = Cookie::get('lastaddress');
        $response = new \Illuminate\Http\Response(view('welcome', [
            'sections' =>[['super_title'=>__('Cities'), 'title'=>__('Find us in these cities and many more!'), 'cities'=>City::where('id', '>', 0)->get()]],
            'lastaddress'=>$lastaddress,
        ]));
---
select * from `cities` where `id` > 0 and `cities`.`deleted_at` is null

    public function restorant($alias)
    {
        $subDomain = $this->getSubDomain();
        if ($subDomain && $alias !== $subDomain) {
            return redirect()->route('restorant', $subDomain);
        }
        $restorant = Restorant::where('subdomain', $alias)->first();

        if ($restorant->active == 1) {
            $restorant->increment('views');

            $canDoOrdering = true;
            if (config('app.isqrsaas')) {
                //In QRsaas with plans, we need to check if they can add new items.
                $currentPlan = Plans::findOrFail($restorant->user->mplanid());
                $canDoOrdering = $currentPlan->enable_ordering == 1;
            }

            //ratings usernames
            $usernames = [];
            if ($restorant && $restorant->ratings) {
                foreach ($restorant->ratings as $rating) {
                    $user = User::where('id', $rating->user_id)->get()->first();
---
select * from `restorants` where `subdomain` = 'leukapizza' limit 1
update `restorants` set `views` = `views` + 1, `restorants`.`updated_at` = '2022-01-24 20:06:11' where `id` = 1
select * from `users` where `id` = 4

            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();
---
select * from `tables` where `restaurant_id` = 1

    public  function allstores(){
        $store=Restorant::all();
---
select * from `restorants`

    public  function searchStore(Request $request){


        $store=Restorant::where('postcode',$request->postcode)->get();
---
select * from `restorants` where `postcode` = '40570'