app/Http/Controllers/ItemsController.php

    public function index()
    {
        if (auth()->user()->hasRole('owner')) {
            $canAdd = true;
            if (config('app.isqrsaas')) {
                //In QRsaas with plans, we need to check if they can add new items.
                $currentPlan = Plans::withTrashed()->find(auth()->user()->mplanid());
                if ($currentPlan == null) {
                    return redirect()->route('plans.current')->withStatus(__('Please subscribe to a plan first'));
                }
                $items = Items::whereIn('category_id', auth()->user()->restorant->categories->pluck('id')->toArray());
                if ($currentPlan->limit_items != 0) {
                    $canAdd = $currentPlan->limit_items > $items->count();
                }
            }

            //Change language
            ConfChanger::switchLanguage(auth()->user()->restorant);

            if (isset($_GET['remove_lang']) && auth()->user()->restorant->localmenus()->count() > 1) {
---
select * from `restorants` where `restorants`.`user_id` = 10 and `restorants`.`user_id` is not null limit 1