app/Http/Controllers/RestorantController.php

    public function index(Restorant $restaurants)
    {
        if (auth()->user()->hasRole('admin')) {
            //return view('restorants.index', ['restorants' => $restaurants->where(['active'=>1])->paginate(10)]);
            return view('restorants.index', ['restorants' => $restaurants->orderBy('id', 'desc')->paginate(10)]);
---
select * from `restorants` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `restorants`

    public function edit(Restorant $restaurant)
    {
        //Days of the week
        $timestamp = strtotime('next Monday');
        for ($i = 0; $i < 7; $i++) {
            $days[] = strftime('%A', $timestamp);
            $timestamp = strtotime('+1 day', $timestamp);
        }

        //Generate days columns
        $hoursRange = [];
        for ($i = 0; $i < 7; $i++) {
            $from = $i.'_from';
            $to = $i.'_to';

            array_push($hoursRange, $from);
            array_push($hoursRange, $to);
        }

        $hours = Hours::where(['restorant_id' => $restaurant->id])->get($hoursRange)->first();

        //Languages
        $available_languages=$restaurant->localMenus()->get()->pluck('languageName','id');
        $default_language=null;
        foreach ($restaurant->localMenus()->get() as $key => $localMenu) {
---
select * from `localmenus` where `localmenus`.`restaurant_id` = 16 and `localmenus`.`restaurant_id` is not null

    public function remove(Restorant $restaurant)
    {
        if (! auth()->user()->hasRole('admin')) {
            dd('Not allowed');
        }

        $user = $restaurant->user;

        //delete restaurant
        $user->restorant->delete();
---
delete from `restorants` where `id` = 3

    public function workingHours(Request $request)
    {
        $hours = Hours::where(['restorant_id' => $request->rid])->first();
---
select * from `hours` where (`restorant_id` = '19') limit 1

        $hours->{'5_to'} = $request->{'5_to'} ?? null;
        $hours->{'6_from'} = $request->{'6_from'} ?? null;
        $hours->{'6_to'} = $request->{'6_to'} ?? null;
        $hours->update();
---
update `hours` set `6_from` = '9:00 AM', `hours`.`updated_at` = '2022-02-01 10:28:20' where `id` = 17

    public function restaurantslocations()
    {
        //TODO - Method for admin onlt
        if (! auth()->user()->hasRole('admin')) {
            dd('Not allowed');
        }

        $toRespond = [
            'restaurants'=> Restorant::where('active', 1)->get(),
        ];
---
select * from `restorants` where `active` = 1